# IsActive Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditScope..::..IsActive Property
EditScope Class See Also
---
Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsActive { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsActive As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsActive {
	bool get ();
}
```

# Remarks
Starting the edit scope is not permitted when it is active. Canceling/committing is not allowed when the edit scope is not active.
# See Also
EditScope Class
Autodesk.Revit.DB Namespace